#include "../Include/puh.h"

/*
    菜单函数
    功能：给用户显示页面
*/

/*主菜单*/
void homeShow(){
    cout <<"*******************************"<< endl;
    cout <<"******  学生选课管理系统  ******"<< endl;
    cout <<"******  1.学生信息管理    ******"<< endl;
    cout <<"******  2.课程信息管理    ******"<< endl;
    cout <<"******  3.学生选课系统    ******"<< endl;
    cout <<"******  4.退出系统        ******"<< endl;
    cout <<"*******************************"<< endl;
    cout <<"请输入您的选择:"<< endl;
}

/*学生管理系统菜单  */
void stuSystemShow(){
    cout <<"**********************************"<< endl;
    cout <<"********  学生信息管理系统 ********"<< endl;
    cout <<"********  1.显示学生信息   ********"<< endl;
    cout <<"********  2.增加学生信息   ********"<< endl;
    cout <<"********  3.删除学生信息   ********"<< endl;
    cout <<"********  4.修改学生信息   ********"<< endl;
    cout <<"********  5.查询学生信息   ********"<< endl;
    cout <<"********  6.退出系统       ********"<< endl;
    cout <<"**********************************"<< endl;
    cout <<"请输入您的选择:"<< endl;
}     

/*课程管理系统菜单*/
void couSystemShow(){
    cout <<"**********************************"<< endl;
    cout <<"********  课程信息管理系统 ********"<< endl;
    cout <<"********  1.显示课程信息   ********"<< endl;
    cout <<"********  2.增加课程信息   ********"<< endl;
    cout <<"********  3.删除课程信息   ********"<< endl;
    cout <<"********  4.修改课程信息   ********"<< endl;
    cout <<"********  5.查询课程信息   ********"<< endl;
    cout <<"********  6.退出系统       ********"<< endl;
    cout <<"**********************************"<< endl;
    cout <<"请输入您的选择:"<< endl;
} 

/*选课系统菜单*/
void selectCouSystem(){
    cout <<"********************************"<< endl;
    cout <<"********  学生选课系统   ********"<< endl;
    cout <<"********  1.学号选课     ********"<< endl;
    cout <<"********  2.姓名选课     ********"<< endl;
    cout <<"********  3.退出系统     ********"<< endl;    
    cout <<"********************************"<< endl;
    cout <<"请输入您的选择:"<< endl;
} 

